Repository: Mikael2983/P13-Python-OC-Lettings-FR
Catalog: docs/source/locale/*/LC_MESSAGES/*_lettings_site.po
Languages: fr

source: oc\_lettings\_site package
fr: oc\_lettings\_site

source: Submodules
fr: Sous Modules

source: oc\_lettings\_site.apps module
fr: oc\_lettings\_site.apps

source: App configuration for the oc_lettings_site project.
fr: Configuration de l’application pour le projet oc_lettings_site.

source: This module defines the configuration class for the `oc_lettings_site` project. It specifies metadata and settings used by Django to initialize the project.
fr: Ce module définit la classe de configuration pour le projet `oc_lettings_site` . Il spécifie les métadonnées et les paramètres utilisés par Django pour initialiser le projet.

source: Configuration class for the oc_lettings_site project.
fr: Classe de configuration pour le projet oc_lettings_site.

source: Attributes:
fr: Attributs

source: name (str): The full Python path to the project.
fr: name (str): Le chemin Python complet vers le projet.

source: oc\_lettings\_site.asgi module
fr: oc\_lettings\_site.asgi

source: ASGI config for oc_lettings_site project.
fr: ASGI configuration pour le projet oc_lettings_site.

source: It exposes the ASGI callable as a module-level variable named `application`.
fr: Il expose l’appelable ASGI comme une variable au niveau du module nommée `application`.

source: For more information on this file, see https://docs.djangoproject.com/en/stable/howto/deployment/asgi/
fr: Pour plus d’informations sur ce fichier, voir: https://docs.djangoproject.com/fr/stable/howto/deployment/asgi/

source: oc\_lettings\_site.settings module
fr: oc\_lettings\_site.settings

source: Django settings for oc_lettings_site project.
fr: Paramètres de Django pour le projet oc_lettings_site.

source: This module contains all the configuration for the Django project, including: - Paths - Security settings - Installed applications - Middleware - Templates - Database - Authentication - Internationalization - Static files
fr: Ce module contient toute la configuration pour le projet Django, y compris: - Chemins - Paramètres de sécurité - Applications installées - Middleware - Templates - Database - Authentication - Internationalization - Fichiers statiques

source: For more information, see: https://docs.djangoproject.com/en/3.0/topics/settings/
fr: Pour plus d’informations sur ce fichier, voir: https://docs.djangoproject.com/fr/5.2/topics/settings/

source: oc\_lettings\_site.urls module
fr: oc\_lettings\_site.urls

source: URL configuration for the oc_lettings_site project.
fr: Configuration des URLs pour le projet oc_lettings_site.

source: This module defines the URL routes for the entire project, including: - The home page - Django admin site - Lettings app - Profiles app - Custom error handlers for 404 and 500 HTTP errors
fr: Ce module définit les routes URL pour l’ensemble du projet, y compris: - La page d’accueil - Site d’administration Django - Application Lettings - Application Profiles - Gestionnaires d’erreurs personnalisés pour les erreurs 404 et 500 HTTP

source: Intentionally triggers a server error (HTTP 500) for testing purposes.
fr: Déclenche intentionnellement une erreur serveur (HTTP 500) à des fins de test.

source: This view function divides 1 by 0 to raise a ZeroDivisionError, which allows developers to verify error monitoring, logging, or external error tracking tools (e.g., Sentry) are working correctly.
fr: Cette fonction de vue divise 1 par 0 pour générer une ZeroDivisionError, ce qui permet aux développeurs de vérifier que la surveillance des erreurs, la journalisation ou les outils externes de suivi des erreurs (par exemple, Sentry) fonctionnent correctement.

source: Parameters
fr: Paramètres

source: The incoming HTTP request object.
fr: L’objet de la requête HTTP entrante.

source: oc\_lettings\_site.views module
fr: oc\_lettings\_site.views

source: Views for the main oc_lettings_site project.
fr: Vues pour le projet principal oc_lettings_site.

source: This module contains views for the home page and custom error pages (404 and 500).
fr: Ce module contient des vues pour la page d’accueil et les pages d’erreurs personnalisées (404 et 500).

source: Handle 404 Page Not Found errors.
fr: Gérer les erreurs 404 de page introuvable.

source: This view is used automatically by Django when a requested page does not exist.
fr: Cette vue est utilisée automatiquement par Django lorsqu’une page demandée n’existe pas.

source: The HTTP request object.
fr: L’objet de requête HTTP.

source: The exception that triggered the 404.
fr: L’exception qui a déclenché le 404.

source: The rendered 'errors/404.html' template with HTTP status code 404.
fr: Le modèle rendu 'errors/404.html' avec le code d’état HTTP 404.

source: Handle 500 Internal Server Error responses.
fr: Gére la réponse au code d’erreur 500 de serveur interne.

source: This view is used automatically by Django when an unhandled server error occurs.
fr: Cette vue est utilisée automatiquement par Django lorsqu’une erreur serveur non gérée se produit.

source: The rendered 'errors/500.html' template with HTTP status code 500.
fr: Le modèle rendu 'errors/500.html' avec le code d’état HTTP 500.

source: Display the home page of the project.
fr: Affiche la page d’accueil du projet.

source: The rendered 'index.html' template.
fr: Le modèle rendu 'index.html'.

source: oc\_lettings\_site.wsgi module
fr: oc\_lettings\_site.wsgi

source: WSGI configuration for the oc_lettings_site project.
fr: Configuration WSGI pour le projet oc_lettings_site.

source: This module exposes the WSGI callable as a module-level variable named `application`. It serves as the entry point for WSGI-compatible web servers to serve your Django project.
fr: Ce module expose l’appelable WSGI comme une variable de niveau module nommée `application`. Il sert de point d’entrée pour les serveurs web compatibles WSGI afin de servir votre projet Django

source: The WSGI configuration loads the project's settings module and prepares the Django application for handling requests.
fr: La configuration WSGI charge le module de paramétrage du projet et prépare l’application Django pour gérer les demandes.

source: Functions:
fr: Fonctions:

source: Returns a WSGI callable to handle requests.
fr: Retourne un WSGI appelable pour gérer les demandes.

source: Environment Variables:
fr: Variables d’environnement:

source: The Python path to the settings module for this Django project.
fr: Le chemin Python vers le module de configuration pour ce projet Django.

source: Example
fr: Exemple

source: To run the application with a WSGI server such as Gunicorn:
fr: Pour exécuter l’application avec un serveur WSGI tel que Gunicorn:
