Repository: Mikael2983/P13-Python-OC-Lettings-FR
Catalog: docs/source/locale/*/LC_MESSAGES/changelog.po
Languages: fr

source: Changelog
fr: journal des modifications

source: All notable changes to the **OC_lettings** project are documented here.
fr: Tous les changements notables apportés au projet **OC_lettings** sont documentés ici.

source: The format follows `Keep a Changelog <https://keepachangelog.com/en/1.0.0/>`_ and the project adheres to `Semantic Versioning <https://semver.org/>`_.
fr: Le format suit « Conserver un journal des modifications <https://keepachangelog.com/fr/1.0.0/> » et le projet adhère au `Versioning sémantique <https://semver.org/>`_.

source: [Unreleased]
fr: [non publié / en cours]

source: Initial Sphinx documentation setup
fr: Configuration de la documentation initiale de Sphinx

source: Base project structure created
fr: Structure de projet de base créée

source: Initial release of **OC_lettings**
fr: Sortie initiale de **OC_lettings**

source: Created `lettings` and `profiles` apps
fr: Création des applications `lettings` et `profiles`

source: Added basic unit tests
fr: Ajout des tests de base

source: Deployed successfully on Render
fr: Déployé avec succès sur Render
