Repository: Mikael2983/P13-Python-OC-Lettings-FR
Catalog: docs/source/locale/*/LC_MESSAGES/lettings.po
Languages: fr

source: lettings package
fr: Package lettings

source: Submodules
fr: Sous-modules

source: lettings.admin module
fr: lettings.admin

source: Admin configuration for the lettings application.
fr: Configuration de l’administration pour l’application lettings.

source: This module registers the `Letting` and `Address` models with the Django admin site so they can be managed through the admin interface.
fr: Ce module enregistre les modèles `Letting` et `Address` avec le site d’administration de Django afin qu’ils puissent être gérés via l’interface d’administration.

source: lettings.apps module
fr: lettings.apps

source: Application configuration for the lettings app.
fr: Module de Configuration de l’application lettings.

source: This module defines the configuration class for the lettings application, used by Django to set up application-specific settings.
fr: Ce module définit la classe de configuration pour l’application lettings, utilisée par Django pour configurer les paramètres spécifiques à l’application.

source: Configuration class for the lettings application.
fr: Classe de configuration pour l’application lettings.

source: The full Python path to the application.
fr: Le chemin Python complet vers l’application.

source: lettings.models module
fr: lettings.models

source: Models for managing property lettings and their associated addresses.
fr: Modèles de gestion des locations et leurs adresses associées.

source: This module defines the database schema for storing information about addresses and property lettings in the application.
fr: Ce module définit le schéma de la base de données pour stocker les informations sur les adresses et les propriétés louées dans l’application.

source: Represents a postal address with number, street, city, state, zip code, and country ISO code.
fr: Représente une adresse postale avec numéro, rue, ville, état, code postal et code ISO du pays

source: Represents a property letting with a title and associated address.
fr: Représente une location avec un titre et l’adresse associée.

source: The models use Django's ORM for database interaction and include validation rules for field values.
fr: Les modèles utilisent l’ORM de Django pour l’interaction avec la base de données et incluent des règles de validation pour les valeurs de champ.

source: Represents a postal address.
fr: Représente une adresse postale.

source: Street number, must be between 1 and 9999.
fr: Numéro de rue, doit être entre 1 et 9999.

source: Street name, up to 64 characters.
fr: Nom de la rue, jusqu’à 64 caractères.

source: City name, up to 64 characters.
fr: Nom de la ville, jusqu’à 64 caractères.

source: State code (2 characters), must be exactly 2 characters.
fr: Le code d’état (2 caractères), doit être exactement de 2 caractères.

source: Postal code, up to 5 digits.
fr: Code postal, jusqu’à 5 chiffres.

source: Country ISO code (3 characters), must be exactly 3 characters.
fr: Code ISO du pays (3 caractères), doit être exactement de 3 caractères.

source: verbose_name (str): a singular name. verbose_name_plural (str): a plural name.
fr: verbose_name (str): un nom singulier. verbose_name_plural (str): un nom pluriel.

source: Returns a string representation of the address in the format "<number> <street>".
fr: Renvoie une représentation sous forme de chaîne de l’adresse au format "<number> <street>".

source: A wrapper for a deferred-loading field. When the value is read from this object the first time, the query is executed.
fr: Un wrapper pour un champ à chargement différé. Lorsque la valeur est lue depuis cet objet pour la première fois, la requête est exécutée.

source: Accessor to the related object on the reverse side of a one-to-one relation.
fr: Accès à l’objet lié au verso d’une relation one-to-one.

source: In the example::
fr: dans l'exemple::

source: ``Place.restaurant`` is a ``ReverseOneToOneDescriptor`` instance.
fr: ``Place.restaurant`` est une instance ``ReverseOneToOneDescriptor”.

source: Represents a property letting.
fr: Représente une location de propriété.

source: The title or name of the letting, up to 256 characters.
fr: Le titre ou le nom de la location, jusqu’à 256 caractères.

source: A one-to-one relationship to an Address instance, representing the location of the letting. Deleting the address will also delete the letting.
fr: Une relation un-à-un avec une instance d’adresse, représentant l’emplacement de la location. Supprimer l’adresse supprimera également la location.

source: Returns the title of the letting.
fr: Renvoie le titre de la location.

source: Accessor to the related object on the forward side of a one-to-one relation.
fr: Accès à l’objet lié du côté direct d’une relation un-à-un.

source: ``Restaurant.place`` is a ``ForwardOneToOneDescriptor`` instance.
fr: ``Restaurant.place`` est une instance de ``ForwardOneToOneDescriptor``

source: lettings.urls module
fr: lettings.urls

source: URL configuration for the lettings application.
fr: Configuration des URLs pour l’application lettings.

source: This module defines the URL patterns for the lettings app, mapping each URL path to the appropriate view function.
fr: Ce module définit les modèles d’URL pour l’application lettings, en mappant chaque chemin d’URL à la fonction de vue appropriée.

source: '' (root of lettings app):
fr: '' (racine de l'application lettings):

source: Displays the list of all lettings.
fr: Afficher la liste de toutes les locations.

source: Displays details for a specific letting identified by its ID.
fr: Affiche les détails d’une location spécifique identifiée par son identifiant.

source: lettings.views module
fr: lettings.views

source: Views for the lettings application.
fr: Vues pour l’application lettings.

source: This module contains view functions for displaying the list of lettings and the details of a specific letting.
fr: Ce module contient des fonctions de visualisation pour afficher la liste des locations et les détails d’une location spécifique.

source: Display the list of all lettings.
fr: Afficher la liste de toutes les locations.

source: Retrieves all `Letting` instances from the database and passes them to the `lettings/index.html` template for rendering.
fr: Récupère toutes les instances `Letting` de la base de données et les passe au modèle `lettings/index.html` pour le rendu.

source: Parameters
fr: Paramètres

source: The HTTP request object.
fr: L’objet de requête HTTP.

source: The rendered HTML page showing all lettings.
fr: La page HTML rendue montrant toutes les locations.

source: Template context:
fr: Contexte du modèle:

source: lettings_list (QuerySet): A queryset containing all lettings.
fr: lettings_list (QuerySet): Une queryset contenant toutes les locations.

source: Display the details of a single letting.
fr: Afficher les détails d’une seule location.

source: Retrieves the `Letting` instance matching the given ID and passes its details to the `lettings/letting.html` template for rendering.
fr: Récupère l’instance `Letting` correspondant à l’ID donné et passe ses détails au modèle `lettings/letting.html` pour le rendu.

source: The primary key of the letting to display.
fr: La clé primaire de l’affichage de la location.

source: The rendered HTML page showing the letting details.
fr: La page HTML rendue montrant les détails de location.

source: title (str): The title of the letting. address (Address): The address object related to the letting.
fr: title (str): Le titre de la location. address (Adresse): L’objet address relatif à la location.

source: If no letting exists with the given `letting_id`.
fr: Si aucune location n’existe avec le `letting_id`donné.
