Repository: Mikael2983/P13-Python-OC-Lettings-FR
Catalog: docs/source/locale/*/LC_MESSAGES/profiles.po
Languages: fr

source: profiles package
fr: package profiles

source: Submodules
fr: Sous-Modules

source: profiles.admin module
fr: profiles.admin

source: Admin configuration for the profiles application.
fr: Configuration de l’administration pour l’application profiles.

source: This module registers the `Profile` model with the Django admin site so they can be managed through the admin interface.
fr: Ce module enregistre le modèle `Profile` avec le site d’administration de Django afin qu’ils puissent être gérés via l’interface d’administration.

source: profiles.apps module
fr: profiles.apps

source: Application configuration for the profiles app.
fr: Module de Configuration de l’application profiles.

source: This module defines the configuration class for the profiles application, used by Django to set up application-specific settings.
fr: Ce module définit la classe de configuration pour l’application profiles, utilisée par Django pour configurer les paramètres spécifiques

source: Configuration class for the profiles application.
fr: Classe de configuration pour l’application profiles.

source: The full Python path to the application.
fr: Le chemin Python complet vers l’application.

source: profiles.models module
fr: profiles.models

source: Models for managing user profiles.
fr: Modèles de gestion des profils utilisateurs.

source: This module defines the database schema for storing additional information related to users in the application.
fr: Ce module définit le schéma de la base de données pour stocker des informations supplémentaires relatives aux utilisateurs dans l’application.

source: Represents a user profile extending Django's built-in User model with additional information, such as the user's favorite city.
fr: Représente un profil utilisateur qui étend le modèle d’utilisateur intégré de Django avec des informations supplémentaires, comme la ville préférée de l’utilisateur.

source: The models use Django's ORM for database interaction and include validation rules for field values.
fr: Les modèles utilisent l’ORM de Django pour l’interaction avec la base de données et incluent des règles de validation pour les valeurs de champ.

source: Represents a user profile.
fr: Représente un profil utilisateur.

source: A one-to-one relationship to Django's built-in User model. Deleting the user will also delete the profile.
fr: Une relation un à un avec le modèle d’utilisateur intégré de Django. Supprimer l’utilisateur supprimera également le profil.

source: The user's preferred city, up to 64 characters.
fr: La ville préférée de l’utilisateur, jusqu’à 64 caractères.

source: Returns the username of the associated user.
fr: Renvoie le nom d’utilisateur de l’utilisateur associé.

source: A wrapper for a deferred-loading field. When the value is read from this object the first time, the query is executed.
fr: Un wrapper pour un champ à chargement différé. Lorsque la valeur est lue depuis cet objet pour la première fois, la requête est exécutée.

source: Accessor to the related object on the forward side of a one-to-one relation.
fr: Accès à l’objet lié au verso d’une relation one-to-one.

source: In the example::
fr: dans l'exemple::

source: ``Restaurant.place`` is a ``ForwardOneToOneDescriptor`` instance.
fr: ``Place.restaurant`` est une instance ``ReverseOneToOneDescriptor”.

source: profiles.urls module
fr: profiles.urls

source: URL configuration for the profiles application.
fr: Configuration des URLs pour l’application profiles.

source: This module defines the URL patterns for the profiles app, mapping each URL path to the appropriate view function.
fr: Ce module définit les modèles d’URL pour l’application profiles, en mappant chaque chemin d’URL à la fonction de vue appropriée.

source: '' (root of profiles app):
fr: '' (racine de l'application profiles):

source: Displays the list of all profiles.
fr: Afficher la liste de tous les profils.

source: Displays details for a specific profile identified by its ID.
fr: Affiche les détails d’un profil spécifique identifié par son identifiant.

source: profiles.views module
fr: profiles.views

source: Views for the profiles application.
fr: Vues pour l’application profiles.

source: This module contains view functions for displaying the list of profiles and the details of a specific profile.
fr: Ce module contient des fonctions de visualisation pour afficher la liste des profils et les détails d’un profil spécifique.

source: Display the list of all profiles.
fr: Afficher la liste de toutes les profils.

source: Retrieves all `Profile` instances from the database and passes them to the `profiles/index.html` template for rendering.
fr: Récupère toutes les instances `Profile` de la base de données et les passe au modèle `profiles/index.html` pour le rendu.

source: Parameters
fr: Paramètres

source: The HTTP request object.
fr: L’objet de requête HTTP.

source: The rendered HTML page showing all profiles.
fr: La page HTML rendue montrant tous les profils.

source: Template context:
fr: Contexte du modèle:

source: profiles_list (QuerySet): A queryset containing all profiles.
fr: profiles_list (QuerySet): une queryset contenant tous les profils.

source: Display the details of a single profile.
fr: Afficher les détails d’un seul profil.

source: Retrieves the `Profile` instance matching the given ID and passes its details to the `profiles/profile.html` template for rendering.
fr: Récupère l’instance `Profile` correspondant à l’ID donné et passe ses détails au modèle `profiles/profile.html` pour le rendu.

source: The username of the profile to display.
fr: Le pseudo du profil à afficher

source: The rendered HTML page showing the profile details.
fr: La page HTML rendue montrant les détails du profil.

source: title (str): The title of the profile. address (Address): The address object related to the profile.
fr: title (str): Le titre du profil. address (Address): L’objet address lié au profil.

source: If no profile exists with the given `profile_id`.
fr: Si aucun profil n’existe avec le `profile_id`donné.
