Repository: Mikael2983/P13-Python-OC-Lettings-FR
Catalog: docs/source/locale/*/LC_MESSAGES/technicalspecification.po
Languages: fr

source: Technical Specifications
fr: spécifications techniques

source: **Frameworks and Libraries**: Django, pytest, flake8, Sentry
fr: *Frameworks et bibliothèques**: Django, pytest, flake8, Sentry

source: **Programming Language**: Python 3.x
fr: **Langage de programmation**: Python 3.x

source: **Other Tools**: Docker, Git, Render (deployment)
fr: **Autres outils**: Docker, Git, Render (déploiement)

source: Database & Models
fr: Base de données et modèles

source: The project uses **SQLite** in development and can be configured with other databases in production.
fr: Le projet utilise **SQLite** en développement et peut être configuré avec d’autres bases de données en production.

source: Main models:
fr: principaux modèles :

source: Fields:
fr: Champs

source: number,
fr: numéro

source: street,
fr: rue

source: city,
fr: ville

source: state,
fr: état

source: zip_code,
fr: code postal

source: country_iso_code
fr: Code ISO du pays

source: Represents a physical address.
fr: Représente une adresse physique.

source: title,
fr: titre,

source: address (ForeignKey to Address)
fr: adresse (ForeignKey à Address)

source: Represents a rental property.
fr: Représente un bien locatif.

source: user (OneToOneField to Django User),
fr: user (OneToOneField à Django User),

source: favorite_city
fr: ville préférée

source: Extends the built-in Django user model with additional attributes.
fr: Étend le modèle utilisateur intégré de Django avec des attributs supplémentaires.

source: **Relationships**:
fr: Relations

source: Each `Letting` is linked to one `Address`.
fr: Chaque `Letting` est liée à une `Address`.

source: Each `Profile` is linked to one Django `User`.
fr: Chaque `Profile` est lié à un utilisateur de Django.

source: The project exposes a simple set of **views and URL patterns**.
fr: Le projet expose un ensemble simple de **vues et d'adresses URL**.

source: `/` → Home page (index view)
fr: `/` → Page d’accueil (vue de l’index)

source: `/lettings/` → Lettings index
fr: `/lettings/` → liste des locations

source: `/lettings/<int:letting_id>/` → Letting detail
fr: `/lettings/<int:letting_id>/` → Détail d'une location

source: `/profiles/` → Profiles index
fr: `/profiles/` → liste des profiles

source: `/profiles/<str:username>/` → Profile detail
fr: `/profiles/<str:username>/` → détail d'un profil

source: `lettings` and `profiles` apps are namespaced to ensure URL clarity and modularity.
fr: `lettings` et `profiles` les applications sont nommées pour assurer la clarté et la modularité de l’URL.
