Repository: Mikael2983/P13-Python-OC-Lettings-FR
Catalog: docs/source/locale/*/LC_MESSAGES/usage.po
Languages: fr

source: Usage
fr: Utilisation

source: The **OC_lettings** application offers the following features:
fr: L'application **OC_lettings** offre les fonctionnalités suivantes :

source: Main Features
fr: Principales fonctionnalités

source: **Home page**: site overview
fr: **Page d'accueil** : aperçu du site

source: **Profiles**: user profile management
fr: **Profils** : gestion des profils utilisateurs

source: **Listings**: rental property management
fr: **Annonces** : gestion immobilière locative

source: Useful Commands
fr: Commandes utiles

source: Build documentation:
fr: Exécutez des tests :

source: Start the local server:
fr: Démarrer le serveur local :

source: Deployment
fr: Déploiement

source: Two deployment options are available:
fr: Deux options de déploiement sont disponibles :

source: For local development, environment variables are **not strictly required**. The application will run with default values if no `.env` file is present:
fr: Pour le développement local, les variables d’environnement ne sont **pas strictement nécessaires*. L’application fonctionnera avec des valeurs par défaut si aucun fichier `.env` n’est présent:

source: `DEBUG` → defaults to `True`
fr: `DEBUG` → par défaut `True`

source: `SECRET_KEY` → automatically generated (different on each run, not stable, not production-ready)
fr: `SECRET_KEY` → généré automatiquement (différent à chaque exécution, pas stable, pas prêt pour la production)

source: `SENTRY_DSN_OC_LETTINGS` → empty (Sentry logging disabled in local development)
fr: `SENTRY_DSN_OC_LETTINGS` → vide (journalisation Sentry désactivée dans le développement local)

source: This means that a developer can run the project without setting up a `.env` file.
fr: Cela signifie qu’un développeur peut exécuter le projet sans configurer de fichier `.env` .

source: However, if you prefer a more stable development environment, you can simply **rename** the provided `.env.example` file to `.env`:
fr: Cependant, si vous préférez un environnement de développement plus stable, vous pouvez simplement **renommer** le fichier `.env.example` fourni à `.env`:

source: **DockerHub deployment** A ready-to-use Docker image is available: `mikael2983/python_lettings_fr:latest`
fr: **Déploiement DockerHub** Une image Docker prête à l'emploi est disponible : `mikael2983/python_lettings_fr:latest`

source: Run the container locally:
fr: Exécutez le conteneur localement :

source: Access the application at: http://127.0.0.1:8000/
fr: Accédez à l'application à l'adresse : http://127.0.0.1:8000/
